package com.jaque.testUtils;

import java.util.HashSet;
import java.util.Iterator;
import java.util.Random;

public class CharUtils {

	static String simple_word = "一丁七万丈三三上下不与丐丑专且世丘丙业丛东丝丢两严丧个中丰串临丸丹为主丽举乃久么义之乌乍乎乏乐乒乓乔乖乘乙九乞也习乡书买乱乳了予争事二于亏云互五井亚些亡交亥亦产亩享京亭亮亲人亿什仁仅仆仇今介仍从仑仓仔他仗付仙代令以仪们仰仲件价任份仿企伊伍伏伐休众优伙会伞伟传伤伦伪伯估伴伶伸伺似佃但位低住佑体何余佛作你佣佩佳使侄侈例侍供依侠侣侥侦侧侨侮侯侵便促俄俊俏俐俗俘保信俩俭修俯俱俺倍倒倔倘候倚借倡倦债值倾假偎偏做停健偶偷偿傀傅傍储催傲傻像僚僧僵僻儒儡儿允元兄充兆先光克免兑兔党兜兢入全八公六兰共关兴兵其具典养兼兽冀内冈册再冒冕冗写军农冠冤冬冯冰冲决况冶冷冻净凄准凉凌减凑凛凝几凡凤凫凭凯凰凳凶凸凹出击函凿刀刁刃分切刊刑划列刘则刚创初删判刨利别刮到制刷券刹刺刻刽剂剃削前剑剔剖剥剧剩剪副割剿劈力劝办功加务劣动助努劫励劲劳势勃勇勉勋勒勘募勤勺勾勿匀包匆匈匕化北匙匠匣匪匹区医匾匿十千升午半华协卑卒卓单卖南博卜占卡卢卤卦卧卫印危即却卵卷卸卿厂厅历厉压厌厕厘厚原厢厦厨去县参又叉及友双反发叔取受变叙叛叠口古句另叨只叫召叭叮可台史右叶号司叹叼叽吁吃各吆合吉吊同名后吏吐向吓吕吗君吝吞吟吠否吧吨吩含听吭吮启吱吴吵吸吹吻吼呀呆呈告呐呕员呛呜呢周味呵呻呼命咆和咏咐咒咕咖咙咧咨咪咬咱咳咸咽哀品哄哆哈响哎哑哗哟哥哨哩哪哭哮哲哺哼唁唆唇唉唐唠唤唧唬售唯唱唾啃啄商啊啡啤啥啦啰啸啼喂善喇喉喊喘喜喝喧喳喷喻嗅嗓嗜嗡嗤嗦嗽嘀嘁嘉嘱嘲嘴嘶嘹嘿器噩噪嚎嚣嚷嚼囊囚四回因团囤园困囱围固国图圃圆圈土圣在地场圾址均坊坎坏坐坑块坚坛坝坞坟坠坡坤坦坪坯坷垂垃垄型垒垛垢垦垫垮埂埃埋城域埠培基堂堆堕堡堤堪堰堵塌塑塔塘塞填境墅墓墙增墨墩壁壕壤士壮声壳壶壹处备复夏夕外多夜够大天太夫夭央夯失头夷夸夹夺奄奇奈奉奋奏契奔奕奖套奠奢奥女奴奶奸她好如妄妆妇妈妒妓妖妙妥妨妹妻姆姊始姐姑姓委姚姜姥姨姻姿威娃娄娇娘娜娩娱娶婆婉婚婴婶婿媒媚媳嫁嫂嫉嫌嫡嫩嬉子孔孕字存孙孝孟季孤学孩孵孽宁它宅宇守安宋完宏宗官宙定宛宜宝实宠审客宣室宦宪宫宰害宴宵家容宽宾宿寂寄密寇富寒寓寝寞察寡寥寨寸对寺寻导寿封射将尉尊小少尔尖尘尚尝尤就尸尺尼尽尾尿局屁层居屈屉届屋屎屏屑展属屠屡履屯山屹屿岁岂岔岖岗岛岩岭岳岸峡峦峭峰峻崇崎崔崖崩崭嵌巍川州巡巢工左巧巨巩巫差己已巴巷巾币市布帅帆师希帐帕帖帘帚帜帝带席帮常帽幅幌幔幕幢干干平年并幸幻幼幽广庄庆庇床序庐库应底店庙府庞废度座庭庵庶康庸廉廊廓延廷建开异弃弄弊式弓引弛弟张弥弦弧弯弱弹强归当录形彤彩彪彬彭彰影役彻彼往征径待很徊律徐徒徒得徘御循微德徽心必忆忌忍志忘忙忠忧快忱念忽忿怀态怎怒怔怕怖怜思怠急性怨怪怯总恃恋恍恐恒恕恢恤恨恩恬恭息恰恳恶恼悄悉悍悔悟悠患悦您悬悯悲悴悼情惊惋惑惕惜惠惦惧惨惩惫惭惯惰想惶惹愁愈愉意愕愚感愤愧愿慈慌慎慕慢慧慨慰慷憋憎憔憨憾懂懈懊懒懦戈戏成我戒或战戚截戳戴户房所扁扇手才扎扑扒打扔托扛扣执扩扫扬扭扮扯扰扳扶批扼找承技抄把抑抒抓投抖抗折抚抛抠抡抢护报披抬抱抵抹押抽拂拄担拆拇拉拌拍拐拒拓拔拖拗拘拙招拜拟拢拣拥拦拧拨择括拭拯拱拳拴拷拼拾拿持挂指按挎挑挖挚挟挠挡挣挤挥挨挪挫振挺挽捂捅捆捉捌捍捎捏捐捕捞损捡换捣捧据捶捷捺捻掀掂授掉掌掏掐排掖掘掠探接控推掩措掰掷掸掺揉揍描提插揖握揣揩揪揭援揽搀搁搂搅搏搓搔搜搞搪搬搭携摄摆摇摊摔摘摧摩摸摹撇撑撒撕撞撤撩撬播撮撰撵撼擂擅操擎擒擦攀攒攘支收改攻放政故效敌敏救教敛敞敢散敦敬数敲整敷文斋斑斗料斜斟斤斥斧斩断斯新方施旁旅旋族旗无既日旦旧旨早旬旭旱时旷旺昂昆昌明昏易昔昙星映春昧昨昭是昵昼显晃晋晌晒晓晕晚晤晦晨普景晰晴晶智晾暂暇暑暖暗暮暴曙曲更曹曼曾替最月有朋服朗望朝期朦木未末本术朱朴朵机朽杀杂权杆杈杉李杏材村杖杜束杠条来杨杭杯杰松板极构枉析枕林枚果枝枢枣枪枫枯架枷柄柏某柑柒染柔柜柠查柬柱柳柴柿栅标栈栋栏树栓栖栗校株样核根格栽桂桃桅框案桌桐桑档桥桦桨桩桶梁梅梆梗梢梦梧梨梭梯械梳检棉棋棍棒棕棘棚棠森棱棵棺椅植椎椒椭椰椿楔楚楞楣楷楼概榄榆榔榕榛榜榨榴槐槽樊樟模横樱橄橘橙橡橱檀檐檩檬欠次欢欣欧欲欺款歇歉歌止正此步武歧歪歹死歼殃殉殊残殖殴段殷殿毁毅母每毒比毕毙毛毡毫毯氏民氓气氛氢氧氨氮氯水永汁求汇汉汗汛汞江池污汤汪汰汹汽沃沈沉沐沙沛沟没沥沦沧沪沫沮河沸油治沼沽沾沿泄泉泊泌法泛泞泡波泣泥注泪泰泳泵泻泼泽洁洋洒洗洛洞津洪洲活洼洽派流浅浆浇浊测济浑浓浙浦浩浪浮浴海浸涂消涉涌涎涕涛涝涡涣涤润涧涨涩涮涯液涵淀淆淋淌淑淘淡淤淫淮深淳混淹添清渊渐渔渗渠渡渣渤温港渴游渺湃湖湘湾湿溃溅溉源溜溢溪溯溶溺滋滑滓滔滚滞满滤滥滨滩滴漂漆漏漓演漠漩漫漱漾潘潜潦潭潮澄澈澎澜澡澳激濒瀑灌火灭灯灰灵灶灸灼灾灿炉炊炎炒炕炫炬炭炮炸点炼烁烂烈烘烙烛烟烤烦烧烫热烹焊焕焙焚焦焰然煌煎煞煤照煮熄熊熏熔熙熟熬燃燎燕燥爆爪爬爱爵父爷爸爹爽片版牌牍牙牛牡牢牧物牲牵特牺犀犁犬犯状犹狂狈狐狗狞狠狡独狭狮狰狱狸狼猎猖猛猜猩猪猫猬献猴猾猿玄率玉王玖玛玩玫环现玲玷玻珊珍珠班球琅理琉琐琢琳琴琼瑞瑟瑰璃璧瓜瓢瓣瓤瓦瓮瓶瓷甘甚甜生甥用甩甫田由甲申电男甸画畅界畏畔留畜略畦番畴畸疆疏疑疗疙疚疟疤疫疮疯疲疹疼疾病症痊痒痕痘痛痢痪痰痴痹瘟瘤瘦瘩瘪瘫瘸瘾癌癞癣登白百皂的皆皇皮皱皿盅盆盈益盏盐监盒盔盖盗盘盛盟目盯盲直相盹盼盾省眉看真眠眨眯眶眷眼着睁睛睡督睦睬睹瞄瞎瞒瞧瞪瞬瞭瞳瞻矗矛矢知矩矫短矮石矾矿码砂砌砍研砖砚砰破砸砾础硅硕硝硫硬确硼碉碌碍碎碑碗碘碟碧碰碱碳碴碾磁磅磕磨磷磺礁示礼社祈祖祝神祟祠祥票祭祷祸禀禁福离禽禾秀私秃秆秉秋种科秒秕秘租秤秦秧秩秫积称秸移秽稀程稍税稚稠稳稻稼稽稿穆穗穴究穷空穿突窃窄窍窑窒窖窗窘窜窝窟窥窿立竖站竞竟章竣童竭端竹竿笆笋笑笔笙笛笤符笨第笼等筋筏筐筑筒答策筛筝筷筹签简箍箕算管箩箫箭箱篇篓篙篡篮篱篷簇簸簿籍米类籽粉粒粗粘粟粤粥粪粮粱粹精糊糕糖糙糜糟糠糯系紊素索紧紫累絮繁纠红纤约级纪纫纬纯纱纲纳纵纷纸纹纺纽线练组绅细织终绊绍绎经绑绒结绕绘给络绝绞统绢绣继绩绪续绰绳维绵绷绸综绽绿缀缅缆缎缓缔缕编缘缚缝缠缤缨缩缭缰缴缸缺罐网罕罗罚罢罩罪置署羊美羔羞羡群羹羽翁翅翎翔翘翠翩翰翻翼耀老考者而耍耐耕耕耗耙耳耸耻耽耿聂聊聋职联聘聚聪肃肄肆肉肋肌肖肘肚肛肝肠股肢肤肥肩肪肮肯育肴肺肾肿胀胁胃胆背胎胖胚胜胞胡胧胯胰胳胶胸能脂脆脉脊脏脐脑脓脖脚脯脱脸脾腊腋腌腐腔腕腥腮腰腹腺腻腾腿膀膊膏膘膛膜膝膨膳臀臂臊臣自臭至致臼舀舅舆舌舍舒舔舞舟航般舰舱舵舶舷船艇艘良艰色艳艺艾节芋芍芒芙芜芝芥芦芬芭芯花芳芹芽苇苍苏苔苗苛苞苟若苦苫英苹茁茂范茄茅茉茎茧茫茬茴茵茶茸荆草荐荒荔荚荞荠荡荣荤荧药荷荸莉莫莱莲获莹莺莽菇菊菌菜菠菩菱菲萄萌萍萎萝萤营萧萨落著葛葡董葫葬葱葵蒂蒋蒙蒜蒲蒸蒿蓄蓉蓖蓝蓬蔑蔓蔗蔚蔫蔬蔼蔽蕉蕊蕴蕾薄薇薛薪薯藏藐藕藤藻蘑蘸虎虏虐虑虚虫虱虹虽虾蚀蚁蚂蚊蚌蚓蚕蚜蚣蚤蚪蚯蛀蛆蛇蛉蛋蛔蛙蛛蛤蛮蛹蛾蜀蜂蜈蜒蜓蜕蜗蜘蜜蜡蜻蝇蝉蝌蝎蝗蝙蝠蝴蝶螃融螟螺蟀蟆蟋蟹蠕蠢血衅行衍衔街衙衡衣补表衩衫衬衰衷袁袄袋袍袒袖袜被袭袱裁裂装裆裉裕裙裤裳裸裹褂褐褒褥襟西要覆见观规觅视览觉角解触言誉誊誓警譬计订认讥讨让训议讯记讲讳讶许讹论讼讽设访诀证评诅识诈诉诊词译试诗诚话诞诡询该详诫诬语误诱诲说诵请诸诺读诽课谁调谅谆谈谊谋谍谎谐谒谓谚谜谢谣谤谦谨谬谭谱谴谷豁豆豌象豪豫豹豺貌贝贞负贡财责贤败账货货质贩贪贫贬购贮贯贰贱贴贵贸费贺贼贾贿赁赂赃资赊赋赌赎赏赐赔赖赘赚赛赞赠赡赢赤赦赫走赴赵赶起趁超越趋趟趣足趴趾跃跋跌跑跛距跟跨跪路跳践跷跺踊踏踢踩踪踱蹂蹄蹈蹋蹦蹬蹭蹲躁躏身躬躯躲躺车轧轨轩转轮软轰轴轻载轿较辅辆辈辉辐辑输辕辖辙辛辜辞辟辣辨辩辫辰辱边辽达迁迂迄迅过迈迎运近返还这进远违连迟迫述迷迹追退送适逃逆选逊透逐递途逗通逛逝逞速造逢逮逸逻逼逾遂遇遍遏道遗遣遥遭遮遵避邀邑邓邢那邦邪邮邻郁郊郎郑部郭都鄙酌配酒酗酝酣酥酪酬酱酵酷酸酿醇醉醋醒采释里重野量金鉴针钉钓钙钝钞钟钠钢钥钦钧钩钮钱钳钻钾铁铃铅铆铐铛铜铝铡铣铭铲银铸铺链销锁锄锅锈锉锋锌锐错锚锡锣锤锥锦锨锭键锯锰锹锻镀镇镊镐镜镣镰镶长门闪闭问闯闰闲间闷闸闹闺闻闽阀阁阅阎阐阔队阱防阳阴阵阶阻阿附际陆陈陋陌降限陕陡院除陨险陪陵陶陷隅隆随隐隔隘隙障隧隶难雀雁雄雅集雇雌雏雕雨雪雳零雷雹雾需震霉霍霎霜霞露霸霹青靖静非靠靡面革靴靶鞋鞍鞠鞭韧韩韭音韵页顶顷项顺须顽顾顿颁颂预颅领颇颈颊频颓颖颗题颜额颠颤风飒飘飞食餐饥饭饮饰饱饲饵饶饺饼饿馁馅馆馋馍馏馒首香马驮驯驰驱驳驴驶驹驻驼驾骂骄骆骇验骏骑骗骚骡骤骨髓高鬓鬼魁魂魄魏魔鱼鲁鲜鲤鲫鲸鳄鳍鳖鳞鸟鸠鸡鸣鸥鸦鸭鸯鸳鸵鸽鸿鹃鹅鹉鹊鹏鹤鹦鹰鹿麦麸麻黄黍黎黑黔默鼎鼓鼠鼻齐齿龄龙龟";
	static String firstName_common = "一乙乃了力丁刀刁二又人入七十几口干工弓久己土大丈女己巾勺丸也于弋巳兀三下上乞士夕千子寸小山川巳才凡公孔亢勾中之丹井介今内及太天屯斗斤牛丑支允元勿午友尤尹引文月日牙王云匀牛四丑仁什切升收壬少心手日氏水尤仍双尺仇止才不互分匹化卡卞肥反夫巴幻户方木比毛仆丰火片古切可瓜甘刊五丘加去句叫外巧巨玉甲令加占主巨冬他代只仗另句召尼正田旦奴凸立叮仝伏台奶凹五外央右未永以戊玉瓦由幼仕巧丘仙兄司且史左世出市玄仔冉穴示生申充主仞仟册加去只叫求正甲申石匝甩丙平母弘末包本弗北必丕半布皿目乏禾皮疋矛乎付兄卉戊民冰玄白卯伉光匡共各考交件价企伍伎仰吉圭曲机艮六仲吉州朱兆决匠地旨朵吏列年劣同打汀至臼灯竹老舟伎吊吏圳的宅机老肉虫伊仰伍印因宇安屹有羊而耳衣亦吃夷奸聿丞企休任先全再冲刑向在夙如宅守字存寺式戌收早旭旬曲次此求系肉臣自舌血行圳西休交件企匠吉尖而至色伏后名回好妃帆灰牟百份米伐亥卉冰刑合向旭朴系行汜复克告改攻更杆谷况伽估君吴吸吾圻均坎研完局岐我扣杞江究见角言住占低佃况里冷伶利助努君吝昌壮妓妞局弄廷弟彤志托杖杜呆李江男究良见角具皂里舟佟你体足甸町豆吞玎位佐佘冶吾吟吴吻完尾巫役忘我修言邑酉吟吴研呆角七伸佐作些伽些初吹呈坐孝宋岐希岑床序巡形忍成杏材杉束村杞步汝汐池私秀赤足身车辰系占伺住余助劭劬邵吸坐壮妆局床志汕江灶见即却克早何布伯伴佛兵判别含坊坂吵宏旱每甫牡况免孚孝尾巫希庇形忙杏呆步汛贝儿供侃刻卦固坤姑官冈庚快抗昆果空亟其具券卷奇委季宜居届岢岸杰佳京侄佳来例制到兔两典卷周呢坦奈妮宙定居屉帖底店征忝忠念技投政枝东林汰决玖知的直纠金两乳侏佰侗佻佬具冽卓拈妲妯宕岱岭帖帙底抒林杼沓炉竺长依侑味夜委宜宛岳岸岩往亚武於易昂旺沅沃汪物艾卧佯儿咏抑昀炎杳事享侍使侈然刹刺协卒洽沁取受步垂奇始炊姓妻妾尚屈弦所承昌升昔松欣沙沈社舍炊采长青幸亟徇佳舍儿争其刷券制效卷姐姒姗季炙宗届岫征承昔析枕状八并佩函和命坡坪奉孟帛水府佛彼忽或戽房扮枇扶放昏朋服明杭杯枚板沛沐汾版牧虎门阜杷盲非冠奎皈客故柑柯况看科肝革屋癸砍禹轨页九亭亮柱俊侣冒段劲南姬姜姣宦帝度痔建峙待律怠急招拒拓拙拉昭架柱柳注治炭界皆突纪纣耐肚致计订军酊俐胃百厘咨姝姿柁沱炭妆纣重珏盅眈俄俞勇威娃姻姚姨屋幽彦奕哀哇玟怡押映昱韦油泳沿姚畏烟盈禹约耶衍要页音昱易柚胤易信侠系俗促俏前则奏型姹妊姝姿室宣巷咱哉思性施昨是春星查柴栅柔染泉帅甚相省砂祈秋穿肖重首酉食香侵俟峙旭注沐炷祉贞昌泓侯保便冒勉匍奔品佩杯封哈皇拔抱怕柏柄泌法泡炳玫盆眉红美虹秒表负面风飞眄胃勃厚咸叛孩奂屏枰某河泛赴库恭拱格桂根耕耿股肯贡高个刚哥宫径挂皋径徒倜恬拯指拿料旅晋朕桌桔桃桐洞流洛酒烈特玲珍真矩祝秩租站级纸纳纽者肩芝记讨酌酒针钉只挑借倒值俱倪倘伦兼唐哲娘旃娟娜展峻准凌洲套爹特留俩倜庭恫耻烙料栗株津玳畜砧恩按案鸟洋秧翁纹耘育芽芸蚊袁烟倚原员埃宴峨倚娱容峪晏移益差师席座徐恰息恕肩持拳拾时书曹校朔桑栽殊气洽珊祠神祖秦秤索素纱纾纯虔讫训财起轩芩闪迅倩幸修仓城夏孙宰容射峡厝叟奚畜春乘借准淞宵指拭牲洵洳狩兹珊炸租站宸挈旁晃桓活洪畔亩眠破炮秘粉纺肺肥航般芳芙花配马侯倍俯俸们圃埋娩峰肪涵畔埔害恢恍恒柏派洹玻泌珉祜呗国寇昆康苦袍规贯够勘崞岗梗珙偕假健停侦剪动翎念基坚堂堆婧寄专张得教救朗条梁梯械梨浙浪珠略皎眷窕竟第终累舵苓架诀近钓顶鸟将那庶振挺捉捐甜祭趾囵堆凌崃带帐徕悌画梁梃桶町娄伟偶务唯问婉寅尉帷庸悟悠悦敖晚梧浴眼研移胃苑英迎野鱼欲浣翌圉乾做区卿参售启商唱娶妇宿崇崎崔常强从悄叙旋晨晟族消爽犀祥绅细紫组绍婧羞习邢舷船茄若处术袖设讼责赦雀雪顷彩常孰侦匙圊执将专就峥崧巢庶彩悉施曹浙笙钏阡凰毫培婚婆妇密彬彪患斌曼海浩烽班瓶毕盒符邦胡背胞胖舶范茅苗袍被觅访货返贩闭麦麻邦壶票冕副埠屏涵捕敏皓梅第珩艴苹敢款淦筐给贵辜开凯昆诒询几蛟植堵堤奠岚帧掌掘捷掏掎推探接敦景智晶替朝椒棠栈殖淘添淡净焦街诊理荔眨贴屠贷轸迢迪迦量钧钮间集杰劳单婷喋传塘塔暖楠殿渡汤帏幄惟掩椅涯液渊焰为异砚围茵越阮轶雁雅寓云雯媛喻贻婺焱琬琰畲劳博堡报富寒嵋帽幅帮弼复彭徨偏整理惠扉排斑酣普棉棒棚涵混淼淮淝牌画番发皓脉茗评贺费买贸迫邯闵防阪黄傅傍媒媚黑瓿匮块干感揆手楷港琨莞夸鼓该贾传仅涂塔塘廊谦提敬斟极楠殿汤渡绢经茎莒获莅庄莉蜀里装解詹鼎贾路迹退铃钜陀电雷靖顿暖桢路嫁农贮贷贴轸迪钠湍琳当略铃鼓励庸园圆奥爱意扬援握榆业杨椰涌渝渭游炜爷烟兽犹煜碗筠义肄莞莠虞蛾裕诣郁钰雍阿预饮衙莹蓊晕渥琬琰畹筵裔淡催传勤势嗣塞嵩厦新喧楸楚岁湘测凑煦琴琪琦睡祺稔稠筮粲绣群圣莎裙诩诗试诠详资载送铅阻雌颂驰熙暄琼塞嵩想桢椿岁渚煮琛庄裟输轼幕汇惶挥描换楣枫湖浑渺涣煤烦琶琥盟睦碑禀聘腑荷莫号蜂补话酩附颁饭晕募焕廓愧沟管纲诰闺魁构歌恺斡荣构嘏通连这甄兢喜团图奖嫡对僚侥屡嶂崭彰廖熊溜监祯种端箕筝精绿紧绫纶置璋畅榔糍滇尔莱赵铬领瑙奁闻嫣愿温源溢尔瑜瑛瑗玮与舞苑诱语郢银摇榕荣温荥溶菸菀鞅瑛僖逑速逍肾寿塾尘嫩实像侨岖慈滋沧溶溪熊狮瑞瑟硕算粹绸综绰绮翠菁菜菖裳认誓诵说诚轻菘造速衔铨限需韶饲饰旗畅荣榕齐熏僦尝墅奖实寨慎准溯搴逢梦仆幕滑瑚珲碧福绵翡腑萍华菩蜜裴豪宾辅郝铭阀陌颇饮凤鸣榜槐滏宽广慷惯概瑰葛葵课逵郭稿靠溉锆俭著价厉剧剑刘妖履帜弹徵德虑摘敌整暂椿闾乐楼樟滴渐涨浆练缔蒂骀落董葶蝶调谆谈诋诤谅论质驼践轮逮进醇铝阵震霆驾驻稽稻稷节剪几鲁黎侬涤墩幢嶙锻褚亿仪影慰忧乐样欧毅演渔熬熠熨瑶缘纬腰万莹叶苇谊逸邮阅院鞍颐养欲颍粗缓卫葳骑妩鉴署啸增婵审层厂厨厮庆摧数枢漆熟热线肠兴萱冲褚谁请贤赏赐趣娴醉锐销爽霄驷确磁穷箭箱竖辍帜漩渐箴节绪翦葸诤谆质醇罚划哗坟墨币庙废慧慕慢暮樊标模流浒汉满漫漂玛缓编腹铺葆葡复卖赋辉辈部锋陛盘码篇范麾劈幡慧摩沪漠磐褒弼荭窥糕膏盖钢龟购器垦横橄篙馆尽坛导惮战撰整历瞳昙暨机橘洁潭灯瑾璋庐积筑蒸诸谛诺练猪赖蹄辑道达都录锦锭陆陶陵霓霖静颊头雕疆腿臻赚骆莅俦橙润澈笃缙萤萤卫谓谒谙谕豫逾游运阴余壅赢蓉蓊勋儒器学宪熹憧晓桥樵橙橡树润潮甑莳璇聪融亲谌谐输遂醒钱错陈陲赛蓄苍侪澍莼谊铮锡阊桦壁奋播抚横潘磨蒙衡谋讳讽辨锚陪默蒲蓓滨嬖凭颖蓉运阴馀恳桧糠馆阶瞰励岭懂挡担据捡激浓烛瞳璐矶磷绩联胶膛临举莲蔗蒋讲递辗镀锻钟键隆队骏黛点泽沣潞澄优婴屿狱赢应忆拥澳营蔚荫舆锾闱阳偿择擅操泽澡燧禧穗簇纵总聪声膝襄谦逮邹乡隋虽霞霜鲜戏鸿壕嫔弥帮桧篷缝繁褒锚韩蔓徵擘扶柜圹归缋蒉磬纩戴拟抬挤爵涛礼简粮职旧蕉谨转遮题镇储藜芷迟鲤翼芸讴医隘额瑷莸镒隗彝潍储丛曙湿织萧蕊蝉瑞适双绣锁垒戴断柠涛泞璐礼粮藜槟滨获壁环蕃丰庞璧馥扩关铿庐疆祷荐勒襟谭证轿辽邻郑邓类鲸丽麓镜觉际橹栎泺辚链韵稳薏薇膺臆蚁袄遗雾愿艳蓣蕹韫玺薛薪绳蟹识赞遵迁选庞渖荐谯镟锵镞铲际颡鹑暹攀簿绘鹏庞瀑宝祢薜谱镆镘矿阚岿藉蓝拢沥泷竞篮罗舰觉警钟露腾党枥槠滤濑炉窦笞筹镦荩严瀛耀译议邀懿赢萨藏薰壤悬曦琼筹脐馨释献坏孀籍藉谵锈钟宝怀瀚缤还迈飘膑朦濒铧顾钚俪栏铁鸡镯藤览镭铎铛膑丽斓樱艺藕誉跃迩莺险续随属攘誉茑鸡藩轰辩癖霸鹤钚灌垄叠笼听芦览读铸籁苈链懿蔼隐璎蕴鳙欢边鳗镔沣镬矿恋兰体滩铄鳞驿验缨织显钻变蘩罐赣雳灵陇酿鹰霭坝嬖观戆厅篱钥瑷镶黉颢逻驴湾灒銮骥湾钻骧鹦艳鹳郁吁";
	static String firstName_simple = "怀耀退老送适考者选而倍耐瀑倒递怕耕倘倚通思借速怠造逢急性逮耳逸总耻逻值逾耿遂假恋灌职恍偏恒道联恕遗聘做停恢健恩聪火恬恭遮息灯恰灰恳灵遵偶灶偿邀悄肄傅悉炉肉炊傍炎邑邓肖肚肝悟悠肠股邢患那肥悦邦储肩肪催悬炭炮邮肯育炸点肺邻肾郁胃烈背像郑胖烙僚烛胞烟惠胡烦部热郭惯想惶胶都脉意脐儒焕感焦愧焰然儿愿允元兄充兆先慈光克酌免配慎酒兔慕党兢慢酣煤入慧全八公六煮兰慰腰共关兴兵其具慷典腹养兼兽腾腿酿内醇冈醉熊册再熏膏冒醒冕熙军膛农膝熟冠冬熬冰冲决况冶冷净懂准采释凌里重野量凑金几凡臣凤自凭凯凰至致凸凹出臼函刀刁分舆切刊舌舍戏成刑我划或列刘战则刚初舞舟判利航别般到舰爱戴爵舵制舶刷户爷舷券刹爹船刺刻爽房所片版手牌前才剑打托牙牛牡扣剧执牧扩物剪扬扮副良牲色艳鉴扶特艺艾承技犀节劈抑抒投抗芙抚力芝加务劣报芦动助努抬励抱花劲劳芳状犹押芽势勃担勇苇勉拉勋苍勒拒拓拔苗勘拙招募拟拢勤拥若苦择拭狮拯拱狱英拳苹勺勾拾勿拿匀持挂范茄包茅指按茎挑化北匙匠挡挤挥猪献振茵匹区挺医十千升午捉半华协捐荐卒卓荔单捕卖南博占卡捡换荣卦卧卫据印即却卷捷荷卿厂玄厅历厉玉莉王掌掏排玖厘掘厚玛原探接厦厨推掩玫莫环莱玲莲获莹莺去玻参又及珊友双反珍描提发取受变叙叛菜叠珠握口古句另菩只叫召班叮可台史右援叶号司吁吃各理合吉吊同名萍后吏向君吝吞吟萤营萧萨含听启琳吴琴吵吸吹吻琼落呆摇呈告著员摘葛瑞瑟葡呢董摧周摩瑰味葵命蒂针钉蒋和咏钓蒙钟钠钢钥璧钧咨播钮撰咱钱蒲咸蒸钻哀品铁铃蓄擅铅哈蓉操哗铛瓜蓝铝哥瓦铭哲铲瓶银铸铺链攀销锁锈锋唐锐蔓蔗攘甘错甚蔚锚甜生锡锦甩甫锭售键唯支田唱由甲申电收男甸改攻画锻蔼放政镀故畅商镇效蕉蕊敌界敏畏救畔教留畜镜敢略敦番敬数整蕴镶啸长疆文薇斑斗料薛喜斟斤喧薪断新方喻施旁旅旋族藏藕旗藤日旦旧旨门早闪旬旭闭问旱间时旺闺闻阀昂阅昆昌明昏易昔昙星队映春昨昭是防阳阴阵阶阻显阿晃附际陆陈晋陌虎限虑晓晕晚院器晨险陪虫普景陵晶陶虹智白虽百蚁暂皂的皆隆皇蚊随隐暖隘暮皮皿雀雁盅雅盆集盈益雌监盒雕盖盘曙四回盟因团雪园目曲盲雳围更直雷相曹固曼国图蛾雾替蜀需省蜂圃圆震月有眉朋看服朗蜜霜朝霞土真眠圣朦在木眨未末本术地朱露朴朵眷霸机眼杆均杉蝉坊坎李坏杏坐材村青杖靖块静坚坛杜坝非坟束靠坡条睡面坤来坦睦杨革坪杭杯杰蝶松板极垂垄构型融鞍析垒枕林枚果枝枢垦枫瞳架埃柄埋城柏某柑染柔矛柜埠柠查知矩韩柱柳石音柴韵培蟹基矿码堂砂栅堆标栈砍栏树研栗砚堡校堤株破堵样根格栽血桂桃案桌行衍桐桑塔衔硕街塘衙塞衡衣桥补桦表确页桶顶顷顾顿梁袁颁颂袄预墅梅领颇颊袍碑袖颖梗碗题额增梦梧碧墨梨墩被梯械壁磁装棉风棒壕裕飘裙棚飞食棠壤磨士壮声裳壶磷处椅复植夏椒褒夕外夜够大天太夫央椰头夷夸示礼社椿奇奈祈奉奋奏奔奕奖祖套楚祝神襟奠祠楣奥祥票祭饭饮饰饲女奴奶楷祷奸楼好西禀要如概妆榆馆妇福妓榔榕妖首香榜妻禾秀私见观规觅览觉始秋种姐槐姑科秒角姓委秘姚姜租解秤秦秧姨秩积姻移姿言威娃娄樊娘娜樟稠模娩横娱樱稳娶稻稽稿橄婆婉穗橘橙婚橡马驰婴穴驴究穷空驻驼驾穿突骆誉验骏骑媒誓媚窥嫁立竖高站竞竟嫡嫩端竹笙次欢欣符欧第欲笼款魁歌子筐筑孔字存孙孝筝孟止季正此步学武警孩筹简宅宇守安殊宋完宏箕殖宗算官宙定宛宜宝实审管计客订宣室认宦讨宪宫箭训议宰记箱讲害讳宴宵段容论讼宽讽宾设宿殿访诀证寄评毅密识寇篇诊富母每译寒寓比毕试诗篙诚毛话询该详寨毫语篮篱诱说诵篷请寸诸对寺诺读导课寿封谁调射谅将谆簇谈尉谊谋小氏谐少民谒谓尔气尖尘尚尝尤谦谨谭就谱水谷永尺尼尽尾簿局层求居豆汇屈屉汉届屋籍屏展汛属江屠池屡汤履汪豪豫屯汰山米屹类鱼屿岁鲁沃沈粉沐岖岗粗沙沛鲜沟鲤沥沧岩沪岭粮岳河岸鲸油粹治精沿泉泌法糕泛泞鳞糠峡泡注峰泳峻系泽洁崇洋崎崔洛贝洞贞负素贡索财责贤津紧货质贩洪紫崭购贮累贯洲贴贵贸费贺活洽派贾流资浆测赋赏赐浑浓赖浙赚赛赞赢赤赦浩浪浴赴赵海起涂消越涌涛涣趣涤润涨涯液足涵趾跃淘川州巡淡巢工左巧巨巫差淮路己巴践巷混添巾一丁币市七布帅帆万丈师三上渊下希不与帐渐丑专且渔世帖丘丙业丛东帜帝鸟渡鸡鸣两严带温个中席帮港丰临丸常游丹为渺主丽帽举鸿繁乃蹄久幅义之乎乏鹏乐幕湖乘湘乙九乞也习乡幢鹤书鹦买鹰干乳平年并幸幻幼幽湾广湿庄了庆庇争溉床事二于序庐源云互库五应井底店庙亚些府溜庞废纠溢红交亥亦度约麦座级亩溪纪享身京纬亭庭亮溯纯纱亲纲纳纵庶溶康庸纸纹人纺麻纽亿线什仁练组黄仅绅仆细仇织终今廊介滋仍绍从黎经滑黑仓廓仔他仗付绘默仙给满绢代绣令滤以滨滩绩仪绪们续仰绰仲绳滴绵件价廷绸建任综份绿开企异漂弄漆伊伍鼎伏式伐休弓缓鼓演缔引编优缘缝伟弟传张漠缤弥伦弦缨漩漫伯估伴伶伸弹伺强佃位低住罐齐归体当何录罗潘余罚佛作你形彤车轨佩彩轩彪彬转彭潭潮置轮彰轰影署佳役轻彼载使轿往征侄径澄待辅侈澈辈辉羊例律侍美徐辑徒输得供辜依羞龟侠澡侣群侥侦侨辨辩侯辰澳侵德边辽达便激翁迁促心俄必迅忆迈俊忍翎迎俏俐运近濒返俗志忘还忙这进保连迟忠翠信忧俩快迫俭修俯俱念迹翼忽班按际";
	static String lastNames = "赵 钱 孙 李 周 吴 郑 王 冯 陈 楮 卫 蒋 沈 韩 杨 朱 秦 尤 许 何 吕 施 张 孔 曹 严 华 金 魏 陶 姜 戚 谢 邹 喻 柏 水 窦 章 云 苏 潘 葛 奚 范 彭 郎 鲁 韦 昌 马 苗 凤 花 方 俞 任 袁 柳 酆 鲍 史 唐 费 廉 岑 薛 雷 贺 倪 汤 滕 殷 罗 毕 郝 邬 安 常 乐 于 时 傅 皮 卞 齐 康 伍 余 元 卜 顾 孟 平 黄 和 穆 萧 尹 姚 邵 湛 汪 祁 毛 禹 狄 米 贝 明 臧 计 伏 成 戴 谈 宋 茅 庞 熊 纪 舒 屈 项 祝 董 梁 杜 阮 蓝 闽 席 季 麻 强 贾 路 娄 危 江 童 颜 郭 梅 盛 林 刁 锺 徐 丘 骆 高 夏 蔡 田 樊 胡 凌 霍 虞 万 支 柯 昝 管 卢 莫 经 房 裘 缪 干 解 应 宗 丁 宣 贲 邓 郁 单 杭 洪 包 诸 左 石 崔 吉 钮 龚 程 嵇 邢 滑 裴 陆 荣 翁 荀 羊 於 惠 甄 麹 家 封 芮 羿 储 靳 汲 邴 糜 松 井 段 富 巫 乌 焦 巴 弓 牧 隗 山 谷 车 侯 宓 蓬 全 郗 班 仰 秋 仲 伊 宫 宁 仇 栾 暴 甘 斜 厉 戎 祖 武 符 刘 景 詹 束 龙 叶 幸 司 韶 郜 黎 蓟 薄 印 宿 白 怀 蒲 邰 从 鄂 索 咸 籍 赖 卓 蔺 屠 蒙 池 乔 阴 郁 胥 能 苍 双 闻 莘 党 翟 谭 贡 劳 逄 姬 申 扶 堵 冉 宰 郦 雍 郤 璩 桑 桂 濮 牛 寿 通 边 扈 燕 冀 郏 浦 尚 农 温 别 庄 晏 柴 瞿 阎 充 慕 连 茹 习 宦 艾 鱼 容 向 古 易 慎 戈 廖 庾 终 暨 居 衡 步 都 耿 满 弘 匡 国 文 寇 广 禄 阙 东 欧 殳 沃 利 蔚 越 夔 隆 师 巩 厍 聂 晁 勾 敖 融 冷 訾 辛 阚 那 简 饶 空 曾 毋 沙 乜 养 鞠 须 丰 巢 关 蒯 相 查 后 荆 红 游 竺 权 逑 盖 益 桓 公 万俟 司马 上官 欧阳 夏侯 诸葛 闻人 东方 赫连 皇甫 尉迟 公羊 澹台 公冶 宗政 濮阳 淳于 单于 太叔 申屠 公孙 仲孙 轩辕 令狐 锺离 宇文 长孙 慕容 鲜于 闾丘 司徒 司空 丌官 司寇 仉 督 子车 颛孙 端木 巫马 公西 漆雕 乐正 壤驷 公良 拓拔 夹谷 宰父 谷梁 晋 楚 阎 法 汝 鄢 涂 钦 段干 百里 东郭 南门 呼延 归 海 羊舌 微生 岳 帅 缑 亢 况 后 有 琴 梁丘 左丘 东门 西门 商 牟 佘 佴 伯 赏 南宫 墨 哈 谯 笪 年 爱 阳 佟";
	static String lastNames_compound = "万俟 司马 上官 欧阳 夏侯 诸葛 闻人 东方 赫连 皇甫 尉迟 公羊 澹台 公冶 宗政 濮阳 淳于 单于 太叔 申屠 公孙 仲孙 轩辕 令狐 锺离 宇文 长孙 慕容 鲜于 闾丘 司徒 司空 丌官 司寇 子车 颛孙 端木 巫马 公西 漆雕 乐正 壤驷 公良 拓拔 夹谷 宰父 谷梁 段干 百里 东郭 南门 呼延 羊舌 微生 梁丘 左丘 东门 西门 南宫";
	static String lastnames_single = "赵 钱 孙 李 周 吴 郑 王 冯 陈 楮 卫 蒋 沈 韩 杨 朱 秦 尤 许 何 吕 施 张 孔 曹 严 华 金 魏 陶 姜 戚 谢 邹 喻 柏 水 窦 章 云 苏 潘 葛 奚 范 彭 郎 鲁 韦 昌 马 苗 凤 花 方 俞 任 袁 柳 酆 鲍 史 唐 费 廉 岑 薛 雷 贺 倪 汤 滕 殷 罗 毕 郝 邬 安 常 乐 于 时 傅 皮 卞 齐 康 伍 余 元 卜 顾 孟 平 黄 和 穆 萧 尹 姚 邵 湛 汪 祁 毛 禹 狄 米 贝 明 臧 计 伏 成 戴 谈 宋 茅 庞 熊 纪 舒 屈 项 祝 董 梁 杜 阮 蓝 闽 席 季 麻 强 贾 路 娄 危 江 童 颜 郭 梅 盛 林 刁 锺 徐 丘 骆 高 夏 蔡 田 樊 胡 凌 霍 虞 万 支 柯 昝 管 卢 莫 经 房 裘 缪 干 解 应 宗 丁 宣 贲 邓 郁 单 杭 洪 包 诸 左 石 崔 吉 钮 龚 程 嵇 邢 滑 裴 陆 荣 翁 荀 羊 於 惠 甄 麹 家 封 芮 羿 储 靳 汲 邴 糜 松 井 段 富 巫 乌 焦 巴 弓 牧 隗 山 谷 车 侯 宓 蓬 全 郗 班 仰 秋 仲 伊 宫 宁 仇 栾 暴 甘 斜 厉 戎 祖 武 符 刘 景 詹 束 龙 叶 幸 司 韶 郜 黎 蓟 薄 印 宿 白 怀 蒲 邰 从 鄂 索 咸 籍 赖 卓 蔺 屠 蒙 池 乔 阴 郁 胥 能 苍 双 闻 莘 党 翟 谭 贡 劳 逄 姬 申 扶 堵 冉 宰 郦 雍 郤 璩 桑 桂 濮 牛 寿 通 边 扈 燕 冀 郏 浦 尚 农 温 别 庄 晏 柴 瞿 阎 充 慕 连 茹 习 宦 艾 鱼 容 向 古 易 慎 戈 廖 庾 终 暨 居 衡 步 都 耿 满 弘 匡 国 文 寇 广 禄 阙 东 欧 殳 沃 利 蔚 越 夔 隆 师 巩 厍 聂 晁 勾 敖 融 冷 訾 辛 阚 那 简 饶 空 曾 毋 沙 乜 养 鞠 须 丰 巢 关 蒯 相 查 后 荆 红 游 竺 权 逑 盖 益 桓 公 仉 督 晋 楚 阎 法 汝 鄢 涂 钦 归 海 岳 帅 缑 亢 况 后 有 琴 商 牟 佘 佴 伯 赏 墨 哈 谯 笪 年 爱 阳 佟";
    
	
	public static void main(String[] args) {
		checkCommom(simple_word,firstName_simple);
		System.out.println(getRandomName_cn(2,false));
		System.out.println(getRandomName_cn(1,true));
		System.out.println(getRandomName_cn(2));
		System.out.println(getRandomName_cn());
	}
	/**
	 * 获取随机姓名，名字长度1或2
	 * @return 返回随机姓名
	 */
	public static String getRandomName_cn() {
	    Random random=new Random();  
	    int firstNameLength = random.nextInt(2);
		return getRandomName_cn(firstNameLength+1);
	}
	/**
	 * 获取固定长度的随机姓名
	 * @param firstNameLength 名字（不含姓）的长度
	 * @return 返回随机姓名
	 */
	public static String getRandomName_cn(int firstNameLength) {
	    Random random=new Random();  
	    StringBuffer sb=new StringBuffer();
	    String[] lastname = lastNames.split(" ");
		sb.append(lastname[random.nextInt(lastname.length)]);
		return sb.toString()+getRandomString(firstNameLength,firstName_simple);
	}
	/**
	 * 获取固定长度名字，复姓或单姓的随机姓名
	 * @param firstNameLength 名字（不含姓）的长度
	 * @param isCompoundSurnName 是否是复姓
	 * @return 返回随机姓名
	 */
	public static String getRandomName_cn(int firstNameLength,boolean isCompoundSurnName){
		
	    Random random=new Random();  
	    StringBuffer sb=new StringBuffer();
	    String[] lastname = null;
	    if(isCompoundSurnName) {
			lastname = lastNames_compound.split(" ");
	    }else {
			lastname = lastnames_single.split(" ");
	    }
		sb.append(lastname[random.nextInt(lastname.length)]);
		return sb.toString()+getRandomString(firstNameLength,firstName_simple);
	}
	
	/**
	 * 获取固定长度的随机英文字母字符串
	 * @param length 长度
	 * @return 返回字符串
	 */
	public static String getRandomString_en(int length){
		//定义一个字符串（A-Z，a-z，0-9）即62位；
	    String str="ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz";
	    return getRandomString(length , str);
	}
	/**
	 * 获取固定长度的随机字符串
	 * @param length 长度
	 * @param strings 随机字符串范围
	 * @return 返回定长字符串
	 */
	public static String getRandomString(int length , String strings){
		//定义一个字符串（A-Z，a-z，0-9）即62位；
	    //由Random生成随机数
	    Random random=new Random();  
	    StringBuffer sb=new StringBuffer();
	    //长度为几就循环几次
	    for(int i=0; i<length; ++i){
	    	//产生0-61的数字
	    	int number=random.nextInt(strings.length());
	    	//将产生的数字通过length次承载到sb中
	    	sb.append(strings.charAt(number));
	    }
	    //将承载的字符转换成字符串
	    return sb.toString();
	}

	public static void checkCommom(String str1, String str2) {
        HashSet<String> result = new HashSet<String>();
        int length1 = str1.length();
        int length2 = str2.length();
        for (int i = 0; i < length1; i++) {
			String char1 = str1.charAt(i) + "";
			for (int j = 0; j < length2; j++) {
                String char2 = str2.charAt(j) + "";
                if (char1.equals(char2))
                {
                    result.add(char1);
                }
            }
        }
        
        Iterator<String> it = result.iterator();
        while (it.hasNext()) {
            String value = it.next();
            System.out.print(value);
        }
    }


    public static int getIntFromStr(String str){
		str=str.trim();
		String str2="";
		if(str != null && !"".equals(str)){
			for(int i=0;i<str.length();i++){
				if(str.charAt(i)>=48 && str.charAt(i)<=57){
					str2+=str.charAt(i);
				}
			}

		}
		return Integer.parseInt(str2);
	}
}
